app/Models/Info/ModelUser.php

    public function AllData()
    {
        $db = $this->db->table('user');
        return $db->get()->getResultArray();
---
SELECT *
FROM `user`