app/Models/PremierLeague/ModelPremierLeague2324.php

    public function AllData()
    {
        $db = $this->db->table('pl2324');
        $db->select('pl2324.id_pl2324');
        $db->select('pl2324.id_club');
        $db->select('pl2324.play');
        $db->select('pl2324.win');
        $db->select('pl2324.draw');
        $db->select('pl2324.lose');
        $db->select('pl2324.goal_in');
        $db->select('pl2324.goal_out');
        $db->select('pl2324.goal_diff');
        $db->select('pl2324.points');
        $db->select('club.id_club');
        $db->select('club.name_club');
        $db->join('club', 'club.id_club = pl2324.id_club', 'left');
        return $db->get()->getResultArray();
---
SELECT `pl2324`.`id_pl2324`, `pl2324`.`id_club`, `pl2324`.`play`, `pl2324`.`win`, `pl2324`.`draw`, `pl2324`.`lose`, `pl2324`.`goal_in`, `pl2324`.`goal_out`, `pl2324`.`goal_diff`, `pl2324`.`points`, `club`.`id_club`, `club`.`name_club`
FROM `pl2324`
LEFT JOIN `club` ON `club`.`id_club` = `pl2324`.`id_club`

    public function UpdateData($data)
    {
        $db = $this->db->table('pl2324');
        return $db->where('id_pl2324', $data['id_pl2324'])->update($data);
---
UPDATE `pl2324` SET `id_pl2324` = '2', `id_club` = '30', `play` = '13', `win` = '9', `draw` = '3', `lose` = '1', `goal_in` = '27', `goal_out` = '10', `goal_diff` = 17, `points` = 30
WHERE `id_pl2324` = '2'