app/Models/PremierLeague/ModelPremierLeague1920.php

    public function AllData()
    {
        $db = $this->db->table('pl1920');
        $db->select('pl1920.id_pl1920');
        $db->select('pl1920.id_club');
        $db->select('pl1920.play');
        $db->select('pl1920.win');
        $db->select('pl1920.draw');
        $db->select('pl1920.lose');
        $db->select('pl1920.goal_in');
        $db->select('pl1920.goal_out');
        $db->select('pl1920.goal_diff');
        $db->select('pl1920.points');
        $db->select('club.id_club');
        $db->select('club.name_club');
        $db->join('club', 'club.id_club = pl1920.id_club', 'left');
        return $db->get()->getResultArray();
---
SELECT `pl1920`.`id_pl1920`, `pl1920`.`id_club`, `pl1920`.`play`, `pl1920`.`win`, `pl1920`.`draw`, `pl1920`.`lose`, `pl1920`.`goal_in`, `pl1920`.`goal_out`, `pl1920`.`goal_diff`, `pl1920`.`points`, `club`.`id_club`, `club`.`name_club`
FROM `pl1920`
LEFT JOIN `club` ON `club`.`id_club` = `pl1920`.`id_club`