app/Models/PremierLeague/ModelPremierLeague2122.php

    public function AllData()
    {
        $db = $this->db->table('pl2122');
        $db->select('pl2122.id_pl2122');
        $db->select('pl2122.id_club');
        $db->select('pl2122.play');
        $db->select('pl2122.win');
        $db->select('pl2122.draw');
        $db->select('pl2122.lose');
        $db->select('pl2122.goal_in');
        $db->select('pl2122.goal_out');
        $db->select('pl2122.goal_diff');
        $db->select('pl2122.points');
        $db->select('club.id_club');
        $db->select('club.name_club');
        $db->join('club', 'club.id_club = pl2122.id_club', 'left');
        return $db->get()->getResultArray();
---
SELECT `pl2122`.`id_pl2122`, `pl2122`.`id_club`, `pl2122`.`play`, `pl2122`.`win`, `pl2122`.`draw`, `pl2122`.`lose`, `pl2122`.`goal_in`, `pl2122`.`goal_out`, `pl2122`.`goal_diff`, `pl2122`.`points`, `club`.`id_club`, `club`.`name_club`
FROM `pl2122`
LEFT JOIN `club` ON `club`.`id_club` = `pl2122`.`id_club`