app/Models/PremierLeague/ModelPremierLeague2223.php

    public function AllData()
    {
        $db = $this->db->table('pl2223');
        $db->select('pl2223.id_pl2223');
        $db->select('pl2223.id_club');
        $db->select('pl2223.play');
        $db->select('pl2223.win');
        $db->select('pl2223.draw');
        $db->select('pl2223.lose');
        $db->select('pl2223.goal_in');
        $db->select('pl2223.goal_out');
        $db->select('pl2223.goal_diff');
        $db->select('pl2223.points');
        $db->select('club.id_club');
        $db->select('club.name_club');
        $db->join('club', 'club.id_club = pl2223.id_club', 'left');
        return $db->get()->getResultArray();
---
SELECT `pl2223`.`id_pl2223`, `pl2223`.`id_club`, `pl2223`.`play`, `pl2223`.`win`, `pl2223`.`draw`, `pl2223`.`lose`, `pl2223`.`goal_in`, `pl2223`.`goal_out`, `pl2223`.`goal_diff`, `pl2223`.`points`, `club`.`id_club`, `club`.`name_club`
FROM `pl2223`
LEFT JOIN `club` ON `club`.`id_club` = `pl2223`.`id_club`