app/Models/PremierLeague/ModelPremierLeague2021.php

SELECT `pl2021`.`id_pl2021`, `pl2021`.`id_club`, `pl2021`.`play`, `pl2021`.`win`, `pl2021`.`draw`, `pl2021`.`lose`, `pl2021`.`goal_in`, `pl2021`.`goal_out`, `pl2021`.`goal_diff`, `pl2021`.`points`, `club`.`id_club`, `club`.`name_club`
FROM `pl2021`
LEFT JOIN `club` ON `club`.`id_club` = `pl2021`.`id_club`
---
    public function AllData()
    {
        $db = $this->db->table('pl2021');
        $db->select('pl2021.id_pl2021');
        $db->select('pl2021.id_club');
        $db->select('pl2021.play');
        $db->select('pl2021.win');
        $db->select('pl2021.draw');
        $db->select('pl2021.lose');
        $db->select('pl2021.goal_in');
        $db->select('pl2021.goal_out');
        $db->select('pl2021.goal_diff');
        $db->select('pl2021.points');
        $db->select('club.id_club');
        $db->select('club.name_club');
        $db->join('club', 'club.id_club = pl2021.id_club', 'left');
        return $db->get()->getResultArray();