app/Models/Database/ModelGroup.php

SELECT *
FROM `group`
---
    public function AllData()
    {
        $db = $this->db->table('group');
        return $db->get()->getResultArray();