app/Models/Database/ModelKnockout.php

    public function AllRO16()
    {
        $db = $this->db->table('ro16');
        return $db->get()->getResultArray();
---
SELECT *
FROM `ro16`