app/Models/Database/ModelConfederation.php

    public function AllData()
    {
        $db = $this->db->table('confederation');
        return $db->get()->getResultArray();
---
SELECT *
FROM `confederation`