app/Models/SerieA/ModelSerieA2122.php

    public function AllData()
    {
        $db = $this->db->table('seriea2122');
        $db->select('seriea2122.id_seriea2122');
        $db->select('seriea2122.id_club');
        $db->select('seriea2122.play');
        $db->select('seriea2122.win');
        $db->select('seriea2122.draw');
        $db->select('seriea2122.lose');
        $db->select('seriea2122.goal_in');
        $db->select('seriea2122.goal_out');
        $db->select('seriea2122.goal_diff');
        $db->select('seriea2122.points');
        $db->select('club.id_club');
        $db->select('club.name_club');
        $db->join('club', 'club.id_club = seriea2122.id_club', 'left');
        return $db->get()->getResultArray();
---
SELECT `seriea2122`.`id_seriea2122`, `seriea2122`.`id_club`, `seriea2122`.`play`, `seriea2122`.`win`, `seriea2122`.`draw`, `seriea2122`.`lose`, `seriea2122`.`goal_in`, `seriea2122`.`goal_out`, `seriea2122`.`goal_diff`, `seriea2122`.`points`, `club`.`id_club`, `club`.`name_club`
FROM `seriea2122`
LEFT JOIN `club` ON `club`.`id_club` = `seriea2122`.`id_club`