app/Models/SerieA/ModelSerieA1920.php

    public function AllData()
    {
        $db = $this->db->table('seriea1920');
        $db->select('seriea1920.id_seriea1920');
        $db->select('seriea1920.id_club');
        $db->select('seriea1920.play');
        $db->select('seriea1920.win');
        $db->select('seriea1920.draw');
        $db->select('seriea1920.lose');
        $db->select('seriea1920.goal_in');
        $db->select('seriea1920.goal_out');
        $db->select('seriea1920.goal_diff');
        $db->select('seriea1920.points');
        $db->select('club.id_club');
        $db->select('club.name_club');
        $db->join('club', 'club.id_club = seriea1920.id_club', 'left');
        return $db->get()->getResultArray();
---
SELECT `seriea1920`.`id_seriea1920`, `seriea1920`.`id_club`, `seriea1920`.`play`, `seriea1920`.`win`, `seriea1920`.`draw`, `seriea1920`.`lose`, `seriea1920`.`goal_in`, `seriea1920`.`goal_out`, `seriea1920`.`goal_diff`, `seriea1920`.`points`, `club`.`id_club`, `club`.`name_club`
FROM `seriea1920`
LEFT JOIN `club` ON `club`.`id_club` = `seriea1920`.`id_club`