app/Models/SerieA/ModelSerieA2223.php

SELECT `seriea2223`.`id_seriea2223`, `seriea2223`.`id_club`, `seriea2223`.`play`, `seriea2223`.`win`, `seriea2223`.`draw`, `seriea2223`.`lose`, `seriea2223`.`goal_in`, `seriea2223`.`goal_out`, `seriea2223`.`goal_diff`, `seriea2223`.`points`, `club`.`id_club`, `club`.`name_club`
FROM `seriea2223`
LEFT JOIN `club` ON `club`.`id_club` = `seriea2223`.`id_club`
---
    public function AllData()
    {
        $db = $this->db->table('seriea2223');
        $db->select('seriea2223.id_seriea2223');
        $db->select('seriea2223.id_club');
        $db->select('seriea2223.play');
        $db->select('seriea2223.win');
        $db->select('seriea2223.draw');
        $db->select('seriea2223.lose');
        $db->select('seriea2223.goal_in');
        $db->select('seriea2223.goal_out');
        $db->select('seriea2223.goal_diff');
        $db->select('seriea2223.points');
        $db->select('club.id_club');
        $db->select('club.name_club');
        $db->join('club', 'club.id_club = seriea2223.id_club', 'left');
        return $db->get()->getResultArray();