app/Models/SerieA/ModelSerieA2324.php

    public function AllData()
    {
        $db = $this->db->table('seriea2324');
        $db->select('seriea2324.id_seriea2324');
        $db->select('seriea2324.id_club');
        $db->select('seriea2324.play');
        $db->select('seriea2324.win');
        $db->select('seriea2324.draw');
        $db->select('seriea2324.lose');
        $db->select('seriea2324.goal_in');
        $db->select('seriea2324.goal_out');
        $db->select('seriea2324.goal_diff');
        $db->select('seriea2324.points');
        $db->select('club.id_club');
        $db->select('club.name_club');
        $db->join('club', 'club.id_club = seriea2324.id_club', 'left');
        return $db->get()->getResultArray();
---
SELECT `seriea2324`.`id_seriea2324`, `seriea2324`.`id_club`, `seriea2324`.`play`, `seriea2324`.`win`, `seriea2324`.`draw`, `seriea2324`.`lose`, `seriea2324`.`goal_in`, `seriea2324`.`goal_out`, `seriea2324`.`goal_diff`, `seriea2324`.`points`, `club`.`id_club`, `club`.`name_club`
FROM `seriea2324`
LEFT JOIN `club` ON `club`.`id_club` = `seriea2324`.`id_club`

    public function InsertData($data)
    {
        $db = $this->db->table('seriea2324');
        return $db->insert($data);
---
INSERT INTO `seriea2324` (`id_club`, `play`, `win`, `draw`, `lose`, `goal_in`, `goal_out`, `goal_diff`, `points`) VALUES ('56', '0', '0', '0', '0', '0', '0', '0', '0')