app/Models/SerieA/ModelSerieA2021.php

SELECT `seriea2021`.`id_seriea2021`, `seriea2021`.`id_club`, `seriea2021`.`play`, `seriea2021`.`win`, `seriea2021`.`draw`, `seriea2021`.`lose`, `seriea2021`.`goal_in`, `seriea2021`.`goal_out`, `seriea2021`.`goal_diff`, `seriea2021`.`points`, `club`.`id_club`, `club`.`name_club`
FROM `seriea2021`
LEFT JOIN `club` ON `club`.`id_club` = `seriea2021`.`id_club`
---
    public function AllData()
    {
        $db = $this->db->table('seriea2021');
        $db->select('seriea2021.id_seriea2021');
        $db->select('seriea2021.id_club');
        $db->select('seriea2021.play');
        $db->select('seriea2021.win');
        $db->select('seriea2021.draw');
        $db->select('seriea2021.lose');
        $db->select('seriea2021.goal_in');
        $db->select('seriea2021.goal_out');
        $db->select('seriea2021.goal_diff');
        $db->select('seriea2021.points');
        $db->select('club.id_club');
        $db->select('club.name_club');
        $db->join('club', 'club.id_club = seriea2021.id_club', 'left');
        return $db->get()->getResultArray();