app/Models/LaLiga/ModelLaLiga1920.php

SELECT `laliga1920`.`id_laliga1920`, `laliga1920`.`id_club`, `laliga1920`.`play`, `laliga1920`.`win`, `laliga1920`.`draw`, `laliga1920`.`lose`, `laliga1920`.`goal_in`, `laliga1920`.`goal_out`, `laliga1920`.`goal_diff`, `laliga1920`.`points`, `club`.`id_club`, `club`.`name_club`
FROM `laliga1920`
LEFT JOIN `club` ON `club`.`id_club` = `laliga1920`.`id_club`
---
    public function AllData()
    {
        $db = $this->db->table('laliga1920');
        $db->select('laliga1920.id_laliga1920');
        $db->select('laliga1920.id_club');
        $db->select('laliga1920.play');
        $db->select('laliga1920.win');
        $db->select('laliga1920.draw');
        $db->select('laliga1920.lose');
        $db->select('laliga1920.goal_in');
        $db->select('laliga1920.goal_out');
        $db->select('laliga1920.goal_diff');
        $db->select('laliga1920.points');
        $db->select('club.id_club');
        $db->select('club.name_club');
        $db->join('club', 'club.id_club = laliga1920.id_club', 'left');
        return $db->get()->getResultArray();