app/Models/LaLiga/ModelLaLiga2021.php

    public function AllData()
    {
        $db = $this->db->table('laliga2021');
        $db->select('laliga2021.id_laliga2021');
        $db->select('laliga2021.id_club');
        $db->select('laliga2021.play');
        $db->select('laliga2021.win');
        $db->select('laliga2021.draw');
        $db->select('laliga2021.lose');
        $db->select('laliga2021.goal_in');
        $db->select('laliga2021.goal_out');
        $db->select('laliga2021.goal_diff');
        $db->select('laliga2021.points');
        $db->select('club.id_club');
        $db->select('club.name_club');
        $db->join('club', 'club.id_club = laliga2021.id_club', 'left');
        return $db->get()->getResultArray();
---
SELECT `laliga2021`.`id_laliga2021`, `laliga2021`.`id_club`, `laliga2021`.`play`, `laliga2021`.`win`, `laliga2021`.`draw`, `laliga2021`.`lose`, `laliga2021`.`goal_in`, `laliga2021`.`goal_out`, `laliga2021`.`goal_diff`, `laliga2021`.`points`, `club`.`id_club`, `club`.`name_club`
FROM `laliga2021`
LEFT JOIN `club` ON `club`.`id_club` = `laliga2021`.`id_club`