app/Models/LaLiga/ModelLaLiga2122.php

    public function AllData()
    {
        $db = $this->db->table('laliga2122');
        $db->select('laliga2122.id_laliga2122');
        $db->select('laliga2122.id_club');
        $db->select('laliga2122.play');
        $db->select('laliga2122.win');
        $db->select('laliga2122.draw');
        $db->select('laliga2122.lose');
        $db->select('laliga2122.goal_in');
        $db->select('laliga2122.goal_out');
        $db->select('laliga2122.goal_diff');
        $db->select('laliga2122.points');
        $db->select('club.id_club');
        $db->select('club.name_club');
        $db->join('club', 'club.id_club = laliga2122.id_club', 'left');
        return $db->get()->getResultArray();
---
SELECT `laliga2122`.`id_laliga2122`, `laliga2122`.`id_club`, `laliga2122`.`play`, `laliga2122`.`win`, `laliga2122`.`draw`, `laliga2122`.`lose`, `laliga2122`.`goal_in`, `laliga2122`.`goal_out`, `laliga2122`.`goal_diff`, `laliga2122`.`points`, `club`.`id_club`, `club`.`name_club`
FROM `laliga2122`
LEFT JOIN `club` ON `club`.`id_club` = `laliga2122`.`id_club`