app/Models/LaLiga/ModelLaLiga2324.php

SELECT `laliga2324`.`id_laliga2324`, `laliga2324`.`id_club`, `laliga2324`.`play`, `laliga2324`.`win`, `laliga2324`.`draw`, `laliga2324`.`lose`, `laliga2324`.`goal_in`, `laliga2324`.`goal_out`, `laliga2324`.`goal_diff`, `laliga2324`.`points`, `club`.`id_club`, `club`.`name_club`
FROM `laliga2324`
LEFT JOIN `club` ON `club`.`id_club` = `laliga2324`.`id_club`
---
    public function AllData()
    {
        $db = $this->db->table('laliga2324');
        $db->select('laliga2324.id_laliga2324');
        $db->select('laliga2324.id_club');
        $db->select('laliga2324.play');
        $db->select('laliga2324.win');
        $db->select('laliga2324.draw');
        $db->select('laliga2324.lose');
        $db->select('laliga2324.goal_in');
        $db->select('laliga2324.goal_out');
        $db->select('laliga2324.goal_diff');
        $db->select('laliga2324.points');
        $db->select('club.id_club');
        $db->select('club.name_club');
        $db->join('club', 'club.id_club = laliga2324.id_club', 'left');
        return $db->get()->getResultArray();