app/Models/LaLiga/ModelLaLiga2223.php

SELECT `laliga2223`.`id_laliga2223`, `laliga2223`.`id_club`, `laliga2223`.`play`, `laliga2223`.`win`, `laliga2223`.`draw`, `laliga2223`.`lose`, `laliga2223`.`goal_in`, `laliga2223`.`goal_out`, `laliga2223`.`goal_diff`, `laliga2223`.`points`, `club`.`id_club`, `club`.`name_club`
FROM `laliga2223`
LEFT JOIN `club` ON `club`.`id_club` = `laliga2223`.`id_club`
---
    public function AllData()
    {
        $db = $this->db->table('laliga2223');
        $db->select('laliga2223.id_laliga2223');
        $db->select('laliga2223.id_club');
        $db->select('laliga2223.play');
        $db->select('laliga2223.win');
        $db->select('laliga2223.draw');
        $db->select('laliga2223.lose');
        $db->select('laliga2223.goal_in');
        $db->select('laliga2223.goal_out');
        $db->select('laliga2223.goal_diff');
        $db->select('laliga2223.points');
        $db->select('club.id_club');
        $db->select('club.name_club');
        $db->join('club', 'club.id_club = laliga2223.id_club', 'left');
        return $db->get()->getResultArray();