app/Models/ModelClub.php

    public function AllData()
    {
        $db = $this->db->table('club');
        $db->select('club.id_club');
        $db->select('club.name_club');
        $db->select('club.code_club');
        $db->select('club.id_club');
        $db->select('club.id_confederation');
        $db->select('club.id_country');
        $db->select('country.name_country');
        $db->select('country.code_country');
        $db->select('country.id_confederation');
        $db->select('confederation.id_confederation');
        $db->select('confederation.name_confederation');
        $db->select('confederation.code_confederation');
        $db->join('country', 'country.id_country = club.id_country', 'left');
        $db->join('confederation', 'confederation.id_confederation = club.id_confederation', 'left');
        return $db->get()->getResultArray();
---
SELECT `club`.`id_club`, `club`.`name_club`, `club`.`code_club`, `club`.`id_club`, `club`.`id_confederation`, `club`.`id_country`, `country`.`name_country`, `country`.`code_country`, `country`.`id_confederation`, `confederation`.`id_confederation`, `confederation`.`name_confederation`, `confederation`.`code_confederation`
FROM `club`
LEFT JOIN `country` ON `country`.`id_country` = `club`.`id_country`
LEFT JOIN `confederation` ON `confederation`.`id_confederation` = `club`.`id_confederation`