app/Models/ModelCL2324.php

    public function AllData()
    {
        $db = $this->db->table('wc22');
        $db->select('wc22.id_wc22');
        $db->select('wc22.id_country');
        $db->select('wc22.id_group');
        $db->select('wc22.play');
        $db->select('wc22.win');
        $db->select('wc22.draw');
        $db->select('wc22.lose');
        $db->select('wc22.goal_in');
        $db->select('wc22.goal_out');
        $db->select('wc22.goal_diff');
        $db->select('wc22.points');
        $db->select('country.id_country');
        $db->select('country.name_country');
        $db->select('group.id_group');
        $db->select('group.code_group');
        $db->join('country', 'country.id_country = wc22.id_country', 'left');
        $db->join('group', 'group.id_group = wc22.id_group', 'left');
        return $db->get()->getResultArray();
---
SELECT `wc22`.`id_wc22`, `wc22`.`id_country`, `wc22`.`id_group`, `wc22`.`play`, `wc22`.`win`, `wc22`.`draw`, `wc22`.`lose`, `wc22`.`goal_in`, `wc22`.`goal_out`, `wc22`.`goal_diff`, `wc22`.`points`, `country`.`id_country`, `country`.`name_country`, `group`.`id_group`, `group`.`code_group`
FROM `wc22`
LEFT JOIN `country` ON `country`.`id_country` = `wc22`.`id_country`
LEFT JOIN `group` ON `group`.`id_group` = `wc22`.`id_group`