app/Models/ModelCountry.php

    public function AllData()
    {
        $db = $this->db->table('country');
        $db->select('country.id_country');
        $db->select('country.name_country');
        $db->select('country.code_country');
        $db->select('country.id_confederation');
        $db->select('confederation.id_confederation');
        $db->select('confederation.name_confederation');
        $db->select('confederation.code_confederation');
        $db->join('confederation', 'confederation.id_confederation = country.id_confederation', 'left');
        return $db->get()->getResultArray();
---
SELECT `country`.`id_country`, `country`.`name_country`, `country`.`code_country`, `country`.`id_confederation`, `confederation`.`id_confederation`, `confederation`.`name_confederation`, `confederation`.`code_confederation`
FROM `country`
LEFT JOIN `confederation` ON `confederation`.`id_confederation` = `country`.`id_confederation`