app/Models/ModelConfederation.php

SELECT *
FROM `confederation`
---
    public function AllData()
    {
        $db = $this->db->table('confederation');
        return $db->get()->getResultArray();