app/Models/ModelCL2324.php

    public function InsertData($data)
    {
        $db = $this->db->table('cl2324');
        return $db->insert($data);
---
INSERT INTO `cl2324` (`id_club`, `id_ro16`) VALUES ('3', '1')