app/Models/ModelKnockout.php

SELECT *
FROM `ro16`
---
    public function AllRO16()
    {
        $db = $this->db->table('ro16');
        return $db->get()->getResultArray();

SELECT *
FROM `final`
---
    public function AllFinal()
    {
        $db = $this->db->table('final');
        return $db->get()->getResultArray();