app/Models/ModelUser.php

SELECT *
FROM `user`
---
    public function AllData()
    {
        $db = $this->db->table('user');
        return $db->get()->getResultArray();